Revit 2024 API
RebarFreeFormAccessor.AddUpdatingSharedParameter Method
 Add existing shared parameter as a dependency for the calculation of the rebar curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public void AddUpdatingSharedParameter(
	ElementId parameterId
)
Visual Basic
Public Sub AddUpdatingSharedParameter ( _
	parameterId As ElementId _
)
Visual C++
public:
void AddUpdatingSharedParameter(
	ElementId^ parameterId
)
Parameters
parameterId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the shared parameter to be added.
Remarks
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. -or- parameterId is a parameter that is not bound to the Rebar element category.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace